SampleCase/constant/pidData
/*--------------------------------*- C++ -*----------------------------------*\
| =========                |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  4.1                                   |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dataAssimData;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Physical locations of the nudging points in the grid. The first point
// corresposts to the reference pressure, P0 (or Pref)
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
pidPositions
List<vector>
10
(
( 0.0000 0.0000 0.0050 )
( 0.0025 0.0050 0.0050 )
( 0.0050 0.0050 0.0050 )
( 0.0075 0.0050 0.0050 )
( 0.0100 0.0025 0.0050 )
( 0.0100 0.0000 0.0050 )
( 0.0100 -0.0025 0.0050 )
( 0.0025 -0.0050 0.0050 )
( 0.0050 -0.0050 0.0050 )
( 0.0075 -0.0050 0.0050 )
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Physical time at which the data was collected, [s]. The solver will perform
// time-interpolation between values of the pidTime array for the calculations
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
pidTime
List<scalar>
3601
(
0.00
0.10
0.20
0.30
0.40
0.50
0.60
0.70
0.80
0.90
1.00
1.10
1.20
1.30
1.40
1.50
1.60
1.70
1.80
1.90
2.00
2.10
2.20
2.30
2.40
2.50
2.60
2.70
2.80
2.90
3.00
3.10
3.20
3.30
3.40
3.50
3.60
3.70
3.80
3.90
4.00
4.10
4.20
4.30
4.40
4.50
4.60
4.70
4.80
4.90
5.00
5.10
5.20
5.30
5.40
5.50
5.60
5.70
5.80
5.90
6.00
6.10
6.20
6.30
6.40
6.50
6.60
6.70
6.80
6.90
7.00
7.10
7.20
7.30
7.40
7.50
7.60
7.70
7.80
7.90
8.00
8.10
8.20
8.30
8.40
8.50
8.60
8.70
8.80
8.90
9.00
9.10
9.20
9.30
9.40
9.50
9.60
9.70
...
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Reference static pressure: length must be equal to number of time steps
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
pidP0
List<scalar>
3601
(
0.0601366
0.0601302
0.0601251
0.0601214
0.0601190
0.0601178
0.0601177
0.0601184
0.0601198
0.0601220
0.0601247
0.0601275
0.0601308
0.0601347
0.0601391
0.0601431
0.0601465
0.0601493
0.0601516
0.0601530
0.0601529
0.0601510
0.0601474
0.0601423
0.0601360
0.0601283
0.0601197
0.0601107
0.0601014
0.0600911
0.0600795
0.0600669
0.0600539
0.0600414
0.0600300
0.0600196
0.0600102
0.0600022
0.0599959
0.0599910
0.0599872
0.0599841
0.0599819
0.0599805
0.0599797
0.0599791
0.0599791
0.0599795
0.0599800
0.0599804
0.0599805
0.0599805
0.0599802
0.0599789
0.0599764
0.0599725
0.0599674
0.0599612
0.0599545
0.0599474
0.0599405
0.0599340
0.0599272
0.0599198
0.0599119
0.0599040
0.0598968
0.0598910
0.0598865
0.0598831
0.0598811
0.0598807
0.0598822
0.0598850
0.0598886
0.0598929
0.0598976
0.0599026
0.0599078
0.0599131
0.0599179
0.0599220
0.0599255
0.0599284
0.0599305
0.0599317
0.0599315
0.0599294
0.0599254
0.0599196
0.0599122
0.0599033
0.0598939
0.0598846
0.0598753
0.0598655
0.0598550
0.0598438
...
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Pressure values: Contatenate from 0:tf for each nudging point, such that
// pidP(pressure1(0:tf);pressure2(0:tf);...)
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
pidP
List<scalar>
21606
(
-0.0601391
-0.0597993
-0.0594389
-0.0590614
-0.0586704
-0.0582698
-0.0578637
-0.0574561
-0.0570512
-0.0566527
-0.0562651
-0.0558924
-0.0555378
-0.0552047
-0.0548971
-0.0546187
-0.0543728
-0.0541621
-0.0539881
-0.0538539
-0.0537616
-0.0537122
-0.0537073
-0.0537456
-0.0538284
-0.0539548
-0.0541235
-0.0543327
-0.0545810
-0.0548669
-0.0551883
-0.0555423
-0.0559252
-0.0563332
-0.0567617
-0.0572071
-0.0576657
-0.0581331
-0.0586047
-0.0590766
-0.0595451
-0.0600060
-0.0604550
-0.0608883
-0.0613019
-0.0616924
-0.0620559
-0.0623890
-0.0626891
-0.0629534
-0.0631796
-0.0633654
-0.0635093
-0.0636103
-0.0636682
-0.0636814
-0.0636502
-0.0635750
-0.0634553
-0.0632926
-0.0630875
-0.0628419
-0.0625582
-0.0622398
-0.0618896
-0.0615104
-0.0611049
-0.0606763
-0.0602289
-0.0597670
-0.0592948
-0.0588166
-0.0583369
-0.0578608
-0.0573934
-0.0569394
-0.0565035
-0.0560901
-0.0557030
-0.0553467
-0.0550250
-0.0547416
-0.0544993
-0.0543001
-0.0541469
-0.0540411
-0.0539850
-0.0539787
-0.0540227
-0.0541175
-0.0542619
-0.0544546
-0.0546930
-0.0549746
-0.0552968
-0.0556574
-0.0560535
-0.0564814
...
);
