SampleCase/constant/pidParameters
/*--------------------------------*- C++ -*----------------------------------*\
| =========                |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  4.1                                   |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dataAssimParameters;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pidPositions
List<vector>
10
(
( 0.0000 0.0000 0.0050 )
( 0.0025 0.0050 0.0050 )
( 0.0050 0.0050 0.0050 )
( 0.0075 0.0050 0.0050 )
( 0.0100 0.0025 0.0050 )
( 0.0100 0.0000 0.0050 )
( 0.0100 -0.0025 0.0050 )
( 0.0025 -0.0050 0.0050 )
( 0.0050 -0.0050 0.0050 )
( 0.0075 -0.0050 0.0050 )
);

pidDirections
List<vector>
10
(
( 0.0000 0.0000 0.0000 )
( 1.0000 0.0000 0.0000 )
( 1.0000 0.0000 0.0000 )
( 1.0000 0.0000 0.0000 )
( 0.0000 -1.0000 0.0000 )
( 1.0000 0.0000 0.0000 )
( 0.0000 1.0000 0.0000 )
( 1.0000 0.0000 0.0000 )
( 1.0000 0.0000 0.0000 )
( 1.0000 0.0000 0.0000 )
);

// ************************************************************************* //
