SampleCase/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (p U);
probeLocations
(
    ( 0.0000  0.0000 0.005) // stagnation
    ( 0.0025  0.0050 0.005) // top
    ( 0.0050  0.0050 0.005) // top
    ( 0.0075  0.0050 0.005) // top
    ( 0.0100  0.0025 0.005) // back
    ( 0.0100  0.0000 0.005) // back
    ( 0.0100 -0.0025 0.005) // back
    ( 0.0025 -0.0050 0.005) // bottom
    ( 0.0050 -0.0050 0.005) // bottom
    ( 0.0075 -0.0050 0.005) // bottom
    ( 0.0200  0.0050 0.005) // wake
    ( 0.0200  0.0000 0.005) // wake
    ( 0.0200 -0.0050 0.005) // wake
);

// ************************************************************************* //
